getTrainData/H6_round_23000/RANS/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	   2.0;
    format	   ascii;
    class	   dictionary;
    location	  "system";
    object	   controlDict;
}
//    author      Huakun Huang
//    Email:      huanghuakun0902@163.com
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             buoyantFoam;

startFrom               latestTime;

startTime               0;

stopAt                  endTime;

endTime                 20000;

deltaT                  1;

writeControl            timeStep;

writeInterval           200;

purgeWrite              2;

timeFormat              general;

timePrecision           6;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

runTimeModifiable        yes;

maxCo        1;

maxAlphaCo        0;

// ************************************************************************* //
