getTrainData/H6_round_23000/RANS/constant/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	turbulenceProperties;
}
simulationType	RAS;
RAS
{
    RASModel        kOmegaSST;

    turbulence      on;

    printCoeffs     on;

     kOmegaSSTCDLMCoeffs
     {
             alphaK1           0.85;
             alphaK2           1;
             alphaOmega1       0.5;
             alphaOmega2       0.856;
             beta1             0.075;
             beta2             0.0828;
             betaStar          0.09;
             beta0Star         0.08;
             gamma1            0.555556;
             gamma2            0.44;
             a1                0.31;
             b1                1;
             c1                10;
             F3                no;
             f1                680;
             f2                400;
             KatoLaunder       yes;
             VortexCorrect     yes;
     }
}
