getTrainData/H6_round_23000/RANS/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ReLength      ReLength [0 1 0 0 0 0 0] 0.04; 
k             k        [1 1 -3 -1 0 0 0] 0.0263;
Twall         Twall    [0 0 0 1 0 0 0] 318;
Tref          Tref     [0 0 0 1 0 0 0] 298;
