getTrainData/H6_round_23000/RANS/0/p
FoamFile
{
	version             2.0;
	format              ascii;
	class               volScalarField;
	location            "0";
	object              p;
}


dimensions	[0 2 -2 0 0 0 0];

internalField	uniform 0.0;

boundaryField
{
	OUT
	{
		type	calculated;
		value	uniform 0.0;
	}
	UPPER
	{
		type	calculated;
		value	uniform 0.0;
	}
	PLANE
	{
		type	calculated;
		value	uniform 0.0;
	}
	WALL2
	{
		type	calculated;
		value	uniform 0.0;
	}
	IN
	{
		type	calculated;
		value	uniform 0.0;
	}
	FRONT
	{
		type	wedge;
	}
	BACK
	{
		type	wedge;
	}
	FRONT2
	{
		type	wedge;
	}
	BACK2
	{
		type	wedge;
	}
}
