getTrainData/H6_round_23000/RANS/0/grad(T)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      grad(T);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   nonuniform List<vector> 
29400
(
(0 0 0)
(0 0 0)
(0 -0 0)
(0 -0 0)
(0 0 0)
(0 -0 0)
(-0 0 0)
(-0 0 0)
...
)
;

boundaryField
{
    BACK
    {
        type            wedge;
    }
    IN
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    UPPER
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    PLANE
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
210
(
(0 0 -712052)
(0 0 -712052)
(0 0 -712052)
(0 0 -712052)
(0 0 -712052)
(0 0 -712052)
(0 0 -712052)
(0 0 -712052)
...
)
;
    }
    AXIS
    {
        type            empty;
    }
    FRONT
    {
        type            wedge;
    }
    FRONT2
    {
        type            wedge;
    }
    BACK2
    {
        type            wedge;
    }
    OUT
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
