getTrainData/H6_round_23000/RANS/0/include/omegaDict
IN
{
   type  fixedValue;
   value  nonuniform List<scalar>
   42
   (
     363.169832
     363.775070
     364.489949
     365.266363
     366.116043
     367.041227
     368.044925
     370.662997
...
  );
}
