getTrainData/H6_round_23000/RANS/0/k
FoamFile
{
	version             2.0;
	format              ascii;
	class               volScalarField;
	location            "0";
	object              k;
}


dimensions	[0 2 -2 0 0 0 0];

internalField	uniform 0.03;

boundaryField
{
	OUT
	{
		type	inletOutlet;
		inletValue	uniform 1.0E-8;
	}
	PLANE
	{
		type	fixedValue;
		value	uniform 1.0E-10;
	}
	WALL2
	{
		type	fixedValue;
		value	uniform 1.0E-10;
	}
    UPPER
    {
		type	fixedValue;
	    value	uniform 1.0E-8;
    }
	/*IN
	{
		type	fixedValue;
		value	nonuniform List<scalar> 
        #include "kDict"
	}*/
    #include "kDict"
	FRONT
	{
		type	wedge;
	}
	BACK
	{
		type	wedge;
	}
	FRONT2
	{
		type	wedge;
	}
	BACK2
	{
		type	wedge;
	}
}
