getTrainData/H6_round_23000/RANS/0/kDict
IN
{

    type        fixedValue;
    value    nonuniform List<scalar>
(
0.237488
0.244877
0.257927
0.275873
0.296884
0.320542
0.345620
0.371369
0.397144
...
);
}
