getTrainData/H6_round_23000/RANS/0/omegaDict
IN
{

    type        fixedValue;
    value    nonuniform List<scalar>
(
231.177297
241.709595
260.946590
288.492541
322.058606
361.897645
406.979350
457.322300
513.776150
...
);
}
