getTrainData/H6_round_23000/RANS/0/velDict
IN
{

    type        surfaceNormalFixedValue;
    refValue    nonuniform List<scalar>
(
-10.734625
-10.701453
-10.644649
-10.565018
-10.469933
-10.361192
-10.240842
-10.111821
-9.974556
...
);
}
