getTrainData/H6_round_23000/RANS/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	   2.0;
    format	   ascii;
    class	   dictionary;
    location	  "system";
    object	   decomposeParDict;
}
//    author      Huakun Huang
//    Email:      huanghuakun0902@163.com
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
numberOfSubdomains  4;
method  scotch;
// ************************************************************************* //
